Revit 2027 API
View.RemoveCalloutParent Method
 Replaces callout parent ID with InvalidElementId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveCalloutParent()
Public Sub RemoveCalloutParent
public:
void RemoveCalloutParent()
member RemoveCalloutParent : unit -> unit
Exceptions
Exception | Condition
InvalidOperationException |  This view is not a callout.
Remarks
 Nothing is done if the callout has already no parent.
See Also
Reference
View Class
Autodesk.Revit.DB Namespace